shurik179/yozh/board_support_package/4.0.1/boards.txt
# Copyright Alexander Kirillov 2023
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


# Yozh Robot
# --------------------------------------
yozh.name=Yozh Robot
yozh.vid.0=0x2341
yozh.pid.0=0x804d
yozh.upload_port.0.vid=0x2341
yozh.upload_port.0.pid=0x804d
yozh.upload_port.0.board=yozh

yozh.upload.tool=bossac
yozh.upload.tool.default=bossac
yozh.upload.tool.network=arduino_ota
yozh.upload.protocol=sam-ba
yozh.upload.maximum_size=262144
yozh.upload.maximum_data_size=32768
yozh.upload.use_1200bps_touch=true
yozh.upload.wait_for_upload_port=true
yozh.upload.native_usb=true
yozh.build.mcu=cortex-m0plus
yozh.build.f_cpu=48000000L
yozh.build.usb_product="Yozh Robot"
yozh.build.usb_manufacturer="Alexander Kirillov"
yozh.build.board=SAMD_ZERO
yozh.build.core=arduino
yozh.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
yozh.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
yozh.build.openocdscript=openocd_scripts/yozh.cfg
yozh.build.variant=yozh
yozh.build.variant_system_lib=
yozh.build.vid=0x2341
yozh.build.pid=0x804d
yozh.bootloader.tool=openocd
yozh.bootloader.tool.default=openocd
yozh.bootloader.file=yozh/samd21_sam_ba.bin

